examples/Bellegoni_2023/emptyFetch/of22_kOmegaSST/system/sampleLines
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

_sampler
{
    type                    sets;
    libs                    (sampling);
    setFormat               csv;
    interpolationScheme     cellPointFace;
    writeControl            onEnd;
    enabled                 false;

    sets
    (
        inlet    // inlet patch face centres
        {
            type        midPoint;
            axis        z;
            start       (-4 0 0);
            end         (-4 0 500);
        }

        incident   // incident
        {
            type        midPoint;
            axis        z;
            start       (0 0 0);
            end         (0 0 500);
        }
    );
}

samples_u
{
    ${_sampler}
    fields                  (U);
    enabled                 true;
}

samples_k
{
    ${_sampler}
    fields                  (k);
    enabled                 true;
}

// samples_epsilon
// {
//     ${_sampler}
//     fields                  (epsilon);
//     enabled                 true;
// }

samples_omega
{
    ${_sampler}
    fields                  (omega);
    enabled                 true;
}

samples_nut
{
    ${_sampler}
    fields                  (nut);
    enabled                 true;
}


// *********************************************************************** //
